#ifndef __number__
#define __number__

//------------------------------------------------------------------------------
// number.h - содержит описание обобщающего числа
//------------------------------------------------------------------------------

#include <fstream>
#include "rnd.h"

//------------------------------------------------------------------------------
// Класс, обобщающий все имеющиеся типы чисел
class Number {
public:
    virtual ~Number() {};
    // Ввод обобщенного числа
    virtual void In(std::ifstream &ifst) = 0;
    // Случайный ввод обобщенной числа
    virtual void InRnd()  = 0;
    // Вывод обобщенного числа
    virtual void Out(std::ofstream &ofst) = 0;
    // Приведение к действительному числу
    virtual double ConvertToRealNumber() = 0;
};

#endif //__number__
